Revit 2024 API
RevitLinkOperations Class
 This class is used to extend the IExternalResourceServer interface with methods to support operations specifically related to Revit links.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class RevitLinkOperations : LinkOperations
Visual Basic
Public Class RevitLinkOperations _
	Inherits LinkOperations
Visual C++
public ref class RevitLinkOperations : public LinkOperations
Remarks
The class owns single-method interfaces which are used as callbacks to perform specific operations on Revit link external resources.
An empty RevitLinkOperations instance is passed to an IExternalResourceServer (inside an ExternalResourceServerExtensions object) via the GetTypeSpecificServerOperations method. The server provider can then add their own implemented interface objects to the RevitLinkOperations, thus making them available to Revit to use as callbacks.
Supporting these additional, type-specific operations is not absolutely required, but is strongly recommended in order for users to be able to perform all the same operations they would with locally-accessed Revit links.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.LinkOperations
 Autodesk.Revit.DB.RevitLinkOperations
See Also
RevitLinkOperations Members
Autodesk.Revit.DB Namespace